// Task 1
// Какое последнее значение выведет этот код? Почему?

let i = 3;
while (i) {
  alert(i--);
} 
// Последним отобразиться 1, т.к. постфиксная форма декремента возвращает старое значение

// End Task 1

// Task 2
// Для каждого цикла запишите, какие значения он выведет. Потом сравните с ответом.
// Оба цикла выводят alert с одинаковыми значениями или нет?

// Префиксный вариант ++i:
i = 0;
while (++i < 5) alert( i ); 
// 1 2 3 4

// Постфиксный вариант i++
i = 0;
while (i++ < 5) alert( i );
// 0 1 2 3 4 5

// End Task 2

// Task 3
// Для каждого цикла запишите, какие значения он выведет. Потом сравните с ответом.
// Оба цикла выведут alert с одинаковыми значениями или нет?

// Постфиксная форма:
for (let i = 0; i < 5; i++) alert( i );
// 0 1 2 3 4 

// Префиксная форма:
for (let i = 0; i < 5; ++i) alert( i );
// 0 1 2 3 4
// Так происходит, потому что на первой итерации выполняется сначало потом условие, потом тело цикла, потом шаг цикла

// End Task 3

// Task 4
// При помощи цикла for выведите чётные числа от 2 до 10.

for (let i = 2; i <= 10; i++){
  if (i % 2 == 0) console.log(i)
}

// End Task 4

// Task 5
// Перепишите код, заменив цикл for на while, без изменения поведения цикла.
// for (let i = 0; i < 3; i++) {
//   alert( `number ${i}!` );
// }

i = 0;
while (i < 3){
  alert( `number ${i}!` );
  i++;
}

// End Task 5

// Task 6
// Напишите цикл, который предлагает prompt ввести число, большее 100. Если посетитель ввёл другое число – попросить ввести ещё раз, и так далее.
// Цикл должен спрашивать число пока либо посетитель не введёт число, большее 100, либо не нажмёт кнопку Отмена (ESC).
// Предполагается, что посетитель вводит только числа. Предусматривать обработку нечисловых строк в этой задаче необязательно.

i = 0
while (i = prompt("Введите число", "")) {
  if (i > 100) {
    break
  }
}

// End Task 6

// Task 7
// Натуральное число, большее 1, называется простым, если оно ни на что не делится, кроме себя и 1.
// Другими словами, n > 1 – простое, если при его делении на любое число кроме 1 и n есть остаток.
// Например, 5 это простое число, оно не может быть разделено без остатка на 2, 3 и 4.
// Напишите код, который выводит все простые числа из интервала от 2 до n.
// Для n = 10 результат должен быть 2,3,5,7.
// P.S. Код также должен легко модифицироваться для любых других интервалов.

let sn = 2
let n = 10

label: for (let i = sn; i <= n; i++) {
  for (let j = sn; j < i; j++) {
    if (i % j == 0) continue label;
  }
  console.log(i);
}

// End Task 7